let y = `11.925148875
2.41344454166667
9.575761
-5.06871055555556
3.83117325
9.7875771
7.15392582142857
3.07851307142857
3.87258927272727
4.77673884615385
4.79247518181818
8.08814703125
2.05100857142857
10.54266725
11.7373865714286
5.157233
2.67106422222222
0.239404714285714
0.371896842105263
0.0799345333333333
2.99215553846154
1.40735345454545
0.23473125
3.07036792307692
6.605257125
9.41250488235294
0.27665375
1.23745863636364
10.7140736923077
0.741643307692308
6.5119828
2.37504006666667
16.18827625
4.8484282
2.170460125
0.6131395
3.608611
2.832564
6.2418804
3.431095125
3.81965522222222
1.3527284
-0.219161545454545
2.0963372
1.5387716
4.42866266666667`;
let y1 = y.split('\n').map((ele) => {
    return parseFloat(ele).toFixed(2);
});
let x = `-0.0133301997202006
-1
-0.0136617209681494
-1.44294854127894
0.232119873957039
0.0759719831085328
-0.117258306985482
0.216016093248252
-0.498071027648529
-0.0495105333830668
-0.687251849512885
-0.0617906129408686
1.91595170430744
0.961762656488736
-0.0908628222035147
1.16714531459867
-1.43653014473335
-0.170763122397862
-0.920793256537902
-0.987092617390479
-0.707434720515776
0.0104351468711825
0.0585861691077101
1.01606308192893
0.353438393698161
0.00410715302629017
0.00727249806064445
0.0371268390044956
-0.0259794600717682
0.0431601683405181
-0.081603211373528
-0.12632431059629
-0.023937901852158
-0.0544679018058031
0.137771422344593
0.112316350255487
0.0342701248613115
-0.0313132253150864
-0.283619605969461
-0.124579575911897
0.267282643251992
-0.145650167288505
0.0344462561682044
-0.0418864561218705
-0.0176546239393159
0.0522767206731853`;
let x1 = x.split('\n').map((ele) => {
    return parseFloat(ele).toFixed(4);
});
let name =
    `杭州武林
杭州庆春
萧山梅花
余杭临平
富阳桂花
临安广场
宁波和义
奉化中心
象山中心
宁海中山
余姚中心
慈溪担山
温州南站
瑞安万松
乐清清远
苍南灵溪
永嘉中心
平阳解放
泰顺罗阳
嘉兴中山
平湖建北
海宁文宗
桐乡振中
湖州苕溪
南浔适园
德清武康
安吉中心
绍兴东街
绍兴柯桥
诸暨城广
上虞解放
金华后街
浦江人东
义乌绣湖
兰溪城西
永康江南
衢州西安
龙游太平
江山城中
丽水府前
遂昌中心
龙泉中心
庆元中心
台州轮渡
黄岩劳动
路桥邮电
临海巾山
玉环中心
舟山人民
普陀沈家`;
let name1 = name.split('\n');
export { x1, y1, name1 };

// [{ dt: '201801' }, { dt: '201809' }, { dt: '201803' }, { dt: '201805' }].sort((a, b) => {
//     return parseInt(a.dt) - parseInt(b.dt);
// });
const a = [8, 4, 5, 2, 9];
const b = [4, 6, 7, 8, 2];
const c = ['w', 't', 'e', 'u', 'k'];
//= >>>>
// 根据多个有对应关系的数组，组合对某个值排序之后导出排序顺序后的数组
function getSortMapArr(type, basic, ...rest) {
    const result = [];
    const arr = [];
    const len = rest.length;
    for (let i = 0, length = basic.length; i < length; i++) {
        const temp = {};
        temp['arr0'] = basic[i];
        for (let k = 0; k < len; k++) {
            temp['arr' + (k + 1)] = rest[k][i];
        }
        arr.push(temp);
    }
    const sortArr = arr.sort((a, b) => {
        return type === 'drop' ? (parseFloat(b['arr0']) - parseFloat(a['arr0'])) : (parseFloat(a['arr0']) - parseFloat(b['arr0']));
    });
    for (let i = 0; i < len + 1; i++) {
        let subResultArr = sortArr.map(ele => ele['arr' + i]);
        result.push(subResultArr);
    }
    return result;
}

// 根据多个有对应关系的数组，组合对某个值排序之后导出排序顺序后的数组
function getSortMapArr2(type, basic) {
    const result = [];
    const arr = [];
    const len = arguments.length - 2;
    // console.log(arguments, [].slice.apply(arguments));
    for (let i = 0, length = basic.length; i < length; i++) {
        const temp = {};
        temp['arr0'] = basic[i];
        for (let k = 0; k < len; k++) {
            temp['arr' + (k + 1)] = arguments[k + 2][i];
        }
        arr.push(temp);
    }
    const sortArr = arr.sort(function(a, b) {
        return type === 'drop' ? (parseFloat(b['arr0']) - parseFloat(a['arr0'])) : (parseFloat(a['arr0']) - parseFloat(b['arr0']));
    });
    for (let i = 0; i < len + 1; i++) {
        let subResultArr = sortArr.map(ele => ele['arr' + i]);
        result.push(subResultArr);
    }
    return result;
}
const mapCode = {
    '杭州市': 'A3301',
    '宁波市': 'A3302',
    '温州市': 'A3303',
    '嘉兴市': 'A3304',
    '湖州市': 'A3305',
    '绍兴市': 'A3306',
    '金华市': 'A3307',
    '衢州市': 'A3308',
    '丽水市': 'A3309',
    '台州市': 'A3310',
    '舟山市': 'A3311',
    '省传输局': 'A3312',
    '股份研发': 'A3314'
};
function getvalkey(obj) {
    const t = {};
    for (let [key, value] of Object.entries(obj)) { // 翻转浙江个地市级编号和名称
        t[value] = key;
    }
    return t;
}
